--============================================================================--
-- Project State (d_project_state)
--============================================================================--
INSERT INTO
  dict.e_dict_value (
    e_dict_id,
    a_dict_value_name_en,
    a_dict_value_name_ru
  )
VALUES
(
  9,
  'Created',
  'Создан'
),
(
  9,
  'Active',
  'В производстве'
),
(
  9,
  'Suspended',
  'Приостановлен'
),
(
  9,
  'Renewed',
  'Возобновлен'
),
(
  9,
  'Closed',
  'Закрыт'
),
(
  9,
  'Archieved',
  'В архиве'
),
(
  9,
  'Rejected',
  'Отклонен'
),
(
  9,
  'Deleted',
  'Удален'
) RETURNING *;
--============================================================================--
