--============================================================================--
-- Customer operation
--============================================================================--
INSERT INTO dict.e_dict_value (
    e_dict_id,
    a_dict_value_name_en,
    a_dict_value_name_ru
) VALUES
(
  40,
  'Created',
  'Создан'
),
(
  40,
  'Updated',
  'Обновлен'
),
(
  40,
  'Deleted',
  'Удален'
),
(
  40,
  'Restored',
  'Восстановлен'
);
--============================================================================--
