--============================================================================--
-- Defect state (d_defect_state)
--============================================================================--
INSERT INTO dict.e_dict_value (
    e_dict_id,
    a_dict_value_name_en,
    a_dict_value_name_ru
) VALUES
(
  37,
  'New',
  'Новое'
),
(
  37,
  'Accepted',
  'Принято'
),
(
  37,
  'Implemented',
  'Реализовано'
),
(
  37,
  'Rejected',
  'Отклонено'
),
(
  37,
  'Implementation',
  'На реализации'
),
(
  37,
  'Not implemented',
  'Не реализовано'
),
(
  37,
  'Deleted',
  'Удалено'
);
--============================================================================--
