--============================================================================--
-- User operation (d_user_operation)
--============================================================================--
INSERT INTO dict.e_dict_value (
    e_dict_id,
    a_dict_value_name_en,
    a_dict_value_name_ru
) VALUES
(
  30,
  'Create user', -- 1
  'Создать пользователя'
),
(
  30,
  'Change user password', -- 2
  'Изменить пароль пользователя'
),
(
  30,
  'Block user', -- 3
  'Заблокировать пользователя'
),
(
  30,
  'Unblock user', -- 4
  'Разблокировать пользователя'
),
(
  30,
  'Delete user', -- 5
  'Удалить пользователя'
),
(
  30,
  'Restore deleted user', -- 6
  'Восстановить удаленного пользователя'
);
--============================================================================--
-- User role operation (d_user_role_operation)
--============================================================================--
INSERT INTO dict.e_dict_value (
    e_dict_id,
    a_dict_value_name_en,
    a_dict_value_name_ru
) VALUES
(
  31,
  'Add user role',
  'Добавить роль пользователя'
),
(
  31,
  'Change user role',
  'Изменить роль пользователя'
),
(
  31,
  'Remove user role',
  'Убрать роль пользователя'
);
--============================================================================--
-- User role (d_user_role)
--============================================================================--
INSERT INTO dict.e_dict_value (
    e_dict_id,
    a_dict_value_name_en,
    a_dict_value_name_ru
) VALUES
(
  32,
  'Top manager',
  'Топ менеджер'
),
(
  32,
  'Project manager',
  'Менеджер проекта'
),
(
  32,
  'Customer',
  'Заказчик'
),
(
  32,
  'Stakeholder',
  'Заинтересованное лицо'
),
(
  32,
  'Domain subject matter',
  'Эксперт предметной области'
),
(
  32,
  'User',
  'Пользователь'
),
(
  32,
  'Designer',
  'Проектировщик'
),
(
  32,
  'Developer',
  'Разработчик'
),
(
  32,
  'Tester',
  'Тестировщик'
),
(
  32,
  'System administrator',
  'Системный администратор'
),
(
  32,
  'Administrator',
  'Администратор'
);
--============================================================================--
-- User state (d_user_state)
--============================================================================--
INSERT INTO dict.e_dict_value (
    e_dict_id,
    a_dict_value_name_en,
    a_dict_value_name_ru
) VALUES
(
  10,
  'Active', -- 1
  'Действующий'
),
(
  10,
  'Blocked', -- 2
  'Заблокирован'
),
(
  10,
  'Deleted', -- 3
  'Удален'
);
--============================================================================--


